Revit 2027 API
ParameterTypeId.ElemDeletableInFamily Property
 "Deletable"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ElemDeletableInFamily { get; }
Public Shared ReadOnly Property ElemDeletableInFamily As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ElemDeletableInFamily {
	ForgeTypeId^ get ();
}
static member ElemDeletableInFamily : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace